app/Repositories/Implementations/UserRepository.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
ORDER BY `id` DESC
---
    public function search(?string $keyword): array
    {
        return $this->model
            ->searchUsers($keyword)
            ->orderBy('id', 'DESC')
            ->findAll();