app/Controllers/AuthController.php

    public function loging_history()
    {
        $db     = \Config\Database::connect();
        $model  = new LoginHistoryModel();
        $userId = session()->get('user_id');
        $role   = session()->get('role');

        $builder = $db->table('login_history')->select('*');

        if ($role !== 'admin') {
            $builder->where('user_id', $userId);
        }

        $data['history'] = $builder
            ->orderBy('login_time', 'DESC')
            ->limit(10)
            ->get()
            ->getResultArray();

        $data['lastLogin'] = $model->where('user_id', $userId)
            ->where('status', 'success')
            ->orderBy('login_time', 'DESC')
            ->first();
---
SELECT *
FROM `login_history`
ORDER BY `login_time` DESC
 LIMIT 10
SELECT *
FROM `login_history`
WHERE `user_id` = '1'
AND `status` = 'success'
ORDER BY `login_time` DESC
 LIMIT 1