app/Controllers/ClientController.php

SELECT *
FROM `users`
---
    public function client_list()
    {
        $clientModel = new ClientModel();
        $userModel   = new UserModel();

        $search       = $this->request->getGet('search');
        $filterUserId = $this->request->getGet('user_id');
        $role         = session()->get('role');
        $loggedUserId = session()->get('user_id');

        $builder = $clientModel->getFilteredClients(
            $role,
            $loggedUserId,
            $search,
            $filterUserId
        );

        $data = [
            'clients'      => $builder->paginate(10, 'clients'),
            'pager'        => $clientModel->pager,
            'search'       => $search,
            'user'         => $userModel->findAll(),

SELECT *
FROM `clients`
WHERE `clients`.`id` = '1'
 LIMIT 1
SELECT *
FROM `customers`
WHERE `customers`.`client_id` = '1'
SELECT *
FROM `transactions`
WHERE `transactions`.`client_id` = '1'
SELECT SUM(`code`) AS `code`
FROM `transactions`
WHERE `transactions`.`client_id` = '1'
SELECT SUM(`extra_code`) AS `extra_code`
FROM `transactions`
WHERE `transactions`.`client_id` = '1'
SELECT SUM(`paid_amount`) AS `paid_amount`
FROM `transactions`
WHERE `transactions`.`client_id` = '1'
SELECT SUM(`remaining_amount`) AS `remaining_amount`
FROM `transactions`
WHERE `transactions`.`client_id` = '1'
---
    public function single_client($id = null)
    {
        $clientModel = new ClientModel();
        $customerModel = new CustomerModel();
        $transactionModel = new TransactionModel();
        $product = $clientModel->where('clients.id', $id)->first();
        $totalCustomer = $customerModel->where('customers.client_id', $id)->findAll();
        $transactions = $transactionModel->where('transactions.client_id', $id)->findAll();
        $totalCode = $transactionModel->where('transactions.client_id', $id)->selectSum('code')->get()->getRow()->code ?? 0;
        $totalExtracode = $transactionModel->where('transactions.client_id', $id)->selectSum('extra_code')->get()->getRow()->extra_code ?? 0;
        $totalPaidAmount = $transactionModel->where('transactions.client_id', $id)->selectSum('paid_amount')->get()->getRow()->paid_amount ?? 0;
        $totalPaindingAmount = $transactionModel->where('transactions.client_id', $id)->selectSum('remaining_amount')->get()->getRow()->remaining_amount ?? 0;
        $totalAmount = $transactionModel->where('transactions.client_id', $id)->selectSum('total_amount')->get()->getRow()->total_amount ?? 0;