app/Controllers/CompanyInfoController.php

SELECT *
FROM `company_info`
---
    public function getCompanies()
    {
        $companyModel = new CompanyInfoModel();
        $companies = $companyModel->findAll();