app/Controllers/CustomerController.php

    public function customer_list()
    {
        $userModel     = new UserModel();
        $clientModel   = new ClientModel();
        $serviceModel  = new ServiceModel();

        $data['users']    = $userModel->findAll();     // dropdown for Admin only
        $data['clients']  = $clientModel->findAll();   // Client filter for both
        $data['services'] = $serviceModel->findAll();  // Service filter for both
---
SELECT *
FROM `users`
SELECT *
FROM `clients`
SELECT *
FROM `services`