app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `clients`
SELECT *
FROM `transactions`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `customers`
SELECT COUNT(*) AS `numrows`
FROM `transactions`
SELECT SUM(`total_amount`) AS `total_amount`
FROM `transactions`
SELECT SUM(`paid_amount`) AS `paid_amount`
FROM `transactions`
SELECT SUM(`remaining_amount`) AS `remaining_amount`
FROM `transactions`
SELECT AVG(`total_amount`) AS `total_amount`
FROM `transactions`
SELECT MAX(`total_amount`) AS `total_amount`
FROM `transactions`
SELECT SUM(`code`) AS `code`
FROM `transactions`
SELECT SUM(`extra_code`) AS `extra_code`
FROM `transactions`
SELECT SUM(`total_amount`) AS `total_amount`
FROM `transactions`
WHERE MONTH(created_at) = '11'
AND YEAR(created_at) = '2025'
SELECT `recipt_no`
FROM `transactions`
ORDER BY `created_at` DESC
 LIMIT 1
---
    public function index(): string
    {
        $user = session()->get();
        $userModel = new UserModel();
        $clientModel = new ClientModel();
        $customerModel = new CustomerModel();
        $transactionModel = new TransactionModel();
        $totalUser = $userModel->countAllResults();
        $totalClient = $clientModel->countAllResults();
        $transactions = $transactionModel->limit(5)->find();
        $totalCustomer = $customerModel->countAllResults();
        $totalTransactions = $transactionModel->countAllResults();

        $totalAmount = $transactionModel->selectSum('total_amount')->get()->getRow()->total_amount ?? 0;
        $totalPaid = $transactionModel->selectSum('paid_amount')->get()->getRow()->paid_amount ?? 0;


        $totalRemaining = $transactionModel->selectSum('remaining_amount')->get()->getRow()->remaining_amount ?? 0;


        $averageTransaction = $transactionModel->selectAvg('total_amount')->get()->getRow()->total_amount ?? 0;

        $averageTransaction = number_format((float)$averageTransaction, 2);

        $highestTransaction = $transactionModel->selectMax('total_amount')->get()->getRow()->total_amount ?? 0;
        $totalCode =  $transactionModel->selectSum('code')->get()->getRow()->code ?? 0;
        $extraCode =  $transactionModel->selectSum('extra_code')->get()->getRow()->extra_code ?? 0;
        $recentTransaction = $transactionModel
            ->select('recipt_no')
            ->orderBy('created_at', 'DESC')
            ->get(1)
            ->getRow();

SELECT SUM(`total_amount`) AS `total_amount`
FROM `transactions`
WHERE MONTH(created_at) = '10'
AND YEAR(created_at) = '2025'
SELECT DATE_FORMAT(created_at, '%Y-%m') AS month, SUM(total_amount) AS total
FROM `transactions`
GROUP BY DATE_FORMAT(created_at, '%Y-%m')
ORDER BY `month` ASC
---
            ->get()->getRow()->total_amount ?? 0;

        // Monthly Revenue Chart Data
        $monthly = $transactionModel->select(
            "DATE_FORMAT(created_at, '%Y-%m') AS month, SUM(total_amount) AS total"
        )
            ->groupBy("DATE_FORMAT(created_at, '%Y-%m')")
            ->orderBy("month", "ASC")
            ->findAll();