app/Controllers/InvoiceController.php

SELECT *
FROM `transactions`
WHERE `transactions`.`id` = '5'
SELECT *
FROM `company_info`
WHERE `company_info`.`id` = '1'
SELECT *
FROM `customers`
WHERE `customers`.`id` = '4'
---
    public function preview($transactionId)
    {
        helper('number');
        $tModel       = new TransactionModel();
        $clientModel  = new ClientModel();
        $customerModel = new CustomerModel();
        $compnayInfoModel = new CompanyInfoModel();
        $termsModel = new TermsModel();
        $bankModel = new BanksModel();
        $hsnCodeModel = new HSNCodeModel();

        $transaction = $tModel->find($transactionId);

        if (!$transaction) {
            return redirect()->back()->with('error', 'Transaction not found.');
        }

        $db = \Config\Database::connect();

        // ===== Company =====
        $company = $compnayInfoModel->find($transaction['company_id']);
        $stateId = $company['state'];
        $query = $db->query('SELECT state_code FROM states WHERE name = ?', [$company['state']]);

        $result = $query->getRow();
        $sellerStateCode = $result ? $result->state_code : null;

        // ===== Customer =====
        $customer = $customerModel->find($transaction['customer_id']);

SELECT *
FROM `hsn_code`
WHERE `hsn_code` = '99831'
 LIMIT 1
SELECT *
FROM `clients`
WHERE `clients`.`id` = '1'
---
        $amountWord = numberToWordsIndian($grandTotal);

        $hsnCode = trim($transaction['hsn_code']);  // remove extra spaces
        $hsnData = $hsnCodeModel->where('hsn_code', $hsnCode)->first();
        $invoice = [
            'invoice_no'       => $transaction['recipt_no'],
            'date'             => $transaction['created_at'],
            'client'           => $clientModel->find($transaction['client_id']),
            'customer'         => $customer,
            'company'          => $company,
            'base_amount'      => $baseAmount,
            'paid_amount'      => $transaction['paid_amount'],
            'remaining_amount' => $transaction['remaining_amount'],
            'total_code'       => $transaction['total_code'],
            'rate'             => $transaction['rate'],
            'code'             => $transaction['code'],
            'remark'           => $transaction['remark'],
            'gst_applied'      => $gstApplied,
            'gst_number'       => $transaction['gst_number'],
            'igst'             => $igst,
            'cgst'             => $cgst,
            'sgst'             => $sgst,
            'grand_total'      => $grandTotal,
            'seller_state_code' => $sellerStateCode,
            'customer_state_code' => $customerStateCode,

SELECT *
FROM `invoices`
WHERE `transaction_id` = '5'
 LIMIT 1
UPDATE `invoices` SET `transaction_id` = '2', `invoice_no` = '82HMY1QE0R', `invoice_date` = '2025-11-25 11:33:29', `company_id` = '1', `customer_id` = '3', `client_id` = '1', `base_amount` = 16000, `paid_amount` = '5000.00', `remaining_amount` = '11000.00', `total_code` = '450.00', `rate` = '40.00', `code` = '400', `remark` = 'Remark', `gst_applied` = 0, `gst_number` = NULL, `igst` = 0, `cgst` = 0, `sgst` = 0, `grand_total` = 16000, `seller_state_code` = '27', `customer_state_code` = '10', `bank_id` = '1', `hsn_code` = '99831', `hsn_description` = 'It services ', `amount_in_word` = 'Sixteen Thousand Rupees Only', `terms` = '1. Acceptance of Terms: Your continued use of our service means you agree to all our terms and conditions.\r\n2. Intellectual Property: All content, logos, and designs on this site belong to us and cannot be used without permission.\r\n3. Limitation of Liability: We are not responsible for any losses or damages resulting from your use of, or inability to use, our service.\r\n4. User Conduct: You agree not to use our service for any illegal activities or to abuse, harass, or harm other users.\r\n5. Termination of Use: We reserve the right to suspend or terminate accounts that violate our rules at any time, without notice.', `updated_at` = '2025-11-26 18:54:01'
WHERE `invoices`.`id` IN ('2')
INSERT INTO `invoices` (`transaction_id`, `invoice_no`, `invoice_date`, `company_id`, `customer_id`, `client_id`, `base_amount`, `paid_amount`, `remaining_amount`, `total_code`, `rate`, `code`, `remark`, `gst_applied`, `gst_number`, `igst`, `cgst`, `sgst`, `grand_total`, `seller_state_code`, `customer_state_code`, `bank_id`, `hsn_code`, `hsn_description`, `amount_in_word`, `terms`, `created_at`, `updated_at`) VALUES ('5', 'PKCD2RV156', '2025-11-26 13:27:58', '1', '4', '1', 25000, '5000.00', '20000.00', '550.00', '50.00', '500', 'Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s ...', 1, NULL, 4500, 0, 0, 29500, '27', '10', '1', '99831', 'It services ', 'Twenty Nine Thousand Five Hundred Rupees Only', '1. Acceptance of Terms: Your continued use of our service means you agree to all our terms and conditions.\r\n2. Intellectual Property: All content, logos, and designs on this site belong to us and cannot be used without permission.\r\n3. Limitation of Liability: We are not responsible for any losses or damages resulting from your use of, or inability to use, our service.\r\n4. User Conduct: You agree not to use our service for any illegal activities or to abuse, harass, or harm other users.\r\n5. Termination of Use: We reserve the right to suspend or terminate accounts that violate our rules at any time, without notice.', '2025-11-26 18:51:56', '2025-11-26 18:51:56')
---
        ];

        // Insert or update: 1 invoice per transaction
        $existing = $invoiceModel->where('transaction_id', $transactionId)->first();
        if ($existing) {
            $invoiceModel->update($existing['id'], $invoiceData);
            $invoiceId = $existing['id'];
        } else {
            $invoiceId = $invoiceModel->insert($invoiceData);