app/Controllers/NotificationController.php

    public function fetchNotifications()
    {
        $notificationModel = new \App\Models\NotificationModel();
        $userId = session()->get('user_id');

        $data = $notificationModel
            ->orderBy('id', 'DESC')
            ->limit(10)
            ->find();
---
SELECT *
FROM `notifications`
ORDER BY `id` DESC
 LIMIT 10