app/Controllers/SettingController.php

    public function settings():string{
        $userModel=new UserModel();
        $user=$userModel->findAll();
---
SELECT *
FROM `users`