app/Controllers/TransactionController.php

SELECT *
FROM `clients`
SELECT *
FROM `customers`
WHERE `user_id` = 'created_by'
SELECT *
FROM `users`
---
    public function transaction_list()
    {
        $transactionModel = new TransactionModel();
        $userModel= new UserModel();
        $filters = [
            'keyword'      => $this->request->getGet('search'),
            'client_id'    => $this->request->getGet('client_id'),
            'customer_id'  => $this->request->getGet('customer_id'),
            'status'       => $this->request->getGet('status'),
            'date_filter'  => $this->request->getGet('date_filter'), // ⭐ Add this
            'from_date'    => $this->request->getGet('from_date'),
            'to_date'      => $this->request->getGet('to_date'),
        ];


        $userRole = session()->get('role');
        $userId   = session()->get('user_id');

        $builder = $transactionModel->getTransaction($userRole, $userId, $filters);

        $data['transactions'] = $builder->paginate(30, 'transactions');
        $data['pager'] = $builder->pager;

        // For dropdown in filters
        $data['clients'] = model('ClientModel')->findAll();
        $userId = ($userRole === 'admin')  ? "created_by" : session()->get('user_id');
        $data['customers'] = model('CustomerModel')->where('user_id', $userId)->findAll();

        // For form to remember filters
        $data['filters'] = $filters;
        $data['users'] =$userModel->findAll();