app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function user_list()
    {
        $model = new UserModel();
        $search = $this->request->getGet('search');

        $builder = $model->searchUsers($search);
        $data = [
            'users'  => $builder->paginate(10, 'users'),
            'pager'  => $model->pager,
            'search' => $search,
        ];

SELECT *
FROM `users`
WHERE `users`.`id` = '9'
UPDATE `users` SET `name` = 'Himanshu  k', `email` = 'himansu@example.com', `phone` = '07004514938', `address` = 'Satawar katal pur siwan bihar', `country` = '101', `state` = '4037', `city` = '57850', `updated_at` = '2025-12-02 05:02:16'
WHERE `users`.`id` IN ('9')
---
    public function update()
    {
        $model = new UserModel();
        $id = $this->request->getPost('id');

        if (! $id || ! $model->find($id)) {
            return redirect()->to(base_url('admin/user-list'))->with('error', 'Invalid user ID.');
        }

        $data = [
            'name'     => trim($this->request->getPost('name')),
            'email'    => trim($this->request->getPost('email')),
            'phone'    => trim($this->request->getPost('phone')),
            'address'  => trim($this->request->getPost('address')),
            'country'  => trim($this->request->getPost('country')),
            'state'    => trim($this->request->getPost('state')),
            'city'     => trim($this->request->getPost('city')),
        ];

        if ($password = $this->request->getPost('password')) {
            $data['password'] = password_hash($password, PASSWORD_BCRYPT);
        }

        $model->skipValidation(true)->update($id, $data);

SELECT *
FROM `countries`
---
    public function getCountry()
    {
        return $this->response->setJSON((new CountryModel())->findAll());

SELECT *
FROM `states`
WHERE `country_id` = '101'
---
    public function getStateByCountry($countryId)
    {
        return $this->response->setJSON((new StateModel())->where('country_id', $countryId)->findAll());

SELECT `clients`.`id`, `clients`.`company_name`, `clients`.`name`, `clients`.`url`, `clients`.`logo`, `created_by`
FROM `clients`
LEFT JOIN `client_users` ON `client_users`.`client_id` = `clients`.`id`
WHERE   (
`clients`.`user_id` = '2'
OR `client_users`.`user_id` = '2'
 )
GROUP BY `clients`.`id`
ORDER BY `clients`.`company_name` ASC
SELECT COUNT(*) AS `numrows`
FROM `customers`
WHERE `user_id` = '2'
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `user_id` = '2'
SELECT SUM(`paid_amount`) AS `paid_amount`
FROM `transactions`
WHERE `user_id` = '2'
SELECT SUM(`remaining_amount`) AS `remaining_amount`
FROM `transactions`
WHERE `user_id` = '2'
SELECT SUM(`code`) AS `code`
FROM `transactions`
WHERE `user_id` = '2'
SELECT `recipt_no`
FROM `transactions`
WHERE `user_id` = '2'
ORDER BY `created_at` DESC
 LIMIT 1
SELECT *
FROM `transactions`
WHERE `user_id` = '2'
ORDER BY `created_at` DESC
 LIMIT 5
SELECT SUM(CASE WHEN gst_applied = 1 THEN grand_total ELSE 0 END) AS amount_with_gst,
        SUM(CASE WHEN gst_applied = 0 THEN total_amount ELSE 0 END) AS amount_without_gst,
        SUM(
            CASE
                WHEN gst_applied = 1 THEN grand_total
                ELSE total_amount
            END
        ) AS overall_amount
FROM `transactions`
WHERE `user_id` = '2'
 LIMIT 1
---
    public function dashboard()
    {
        $clientModel = new ClientModel();
        $clientUserModel = new ClientUserModel();
        $customerModel = new CustomerModel();
        $userModel = new UserModel();
        $role = session()->get('role');
        $userId = session()->get('user_id');
        $transactionModel = new TransactionModel();
        $clients = $clientModel->select('clients.id, clients.company_name, clients.name,clients.url,clients.logo,created_by')
            ->join('client_users', 'client_users.client_id = clients.id', 'left')
            ->groupStart()
            ->where('clients.user_id', $userId)
            ->orWhere('client_users.user_id', $userId)
            ->groupEnd()
            ->groupBy('clients.id')
            ->orderBy('clients.company_name', 'ASC')
            ->get()
            ->getResultArray();



        $totalCustomer = $customerModel->where('user_id', $userId)->countAllResults();
        $transactionCount = $transactionModel->where('user_id', $userId)->countAllResults();
        $totalPaid = $transactionModel->where('user_id', $userId)->selectSum('paid_amount')->get()->getRow()->paid_amount ?? 0;
        $totalRemaining = $transactionModel->where('user_id', $userId)->selectSum('remaining_amount')->get()->getRow()->remaining_amount ?? 0;
        $totalLienceKeys = $transactionModel->where('user_id', $userId)->selectSum('code')->get()->getRow()->code ?? 0;
        $totalCode =  $transactionModel->where('user_id', $userId)->selectSum('code')->get()->getRow()->code ?? 0;
        $extraCode =  $transactionModel->where('user_id', $userId)->selectSum('extra_code')->get()->getRow()->extra_code ?? 0;
        $recentTransaction = $transactionModel->where('user_id', $userId)
            ->select('recipt_no')
            ->orderBy('created_at', 'DESC')
            ->get(1)
            ->getRow();
        $recentFiveTransaction= $transactionModel->where('user_id',$userId)->orderBy('created_at','DESC')->findAll(5);
        $recentTransactionCode = $recentTransaction->recipt_no ?? 'No Transactions Yet';
        $totals = $transactionModel
            ->select("
        SUM(CASE WHEN gst_applied = 1 THEN grand_total ELSE 0 END) AS amount_with_gst,
        SUM(CASE WHEN gst_applied = 0 THEN total_amount ELSE 0 END) AS amount_without_gst,
        SUM(
            CASE
                WHEN gst_applied = 1 THEN grand_total
                ELSE total_amount
            END
        ) AS overall_amount
    ", false)
         ->where('user_id',$userId)
            ->first();