app/Models/CommanModel.php

SELECT SUM(`total_amount`) AS `total_amount`
FROM `transactions`
SELECT SUM(`total_amount`) AS `total_amount`
FROM `transactions`
WHERE `user_id` = '2'
---
    public function getcounter()
    {
        $transactionModel = new TransactionModel();
        $role = session()->get('role');
        $userId = session()->get('user_id');
        $totalAmount = ($role === 'admin') ? $transactionModel->selectSum('total_amount')->get()->getRow()->total_amount ?? 0
            : $transactionModel->selectSum('total_amount')->where('user_id', $userId)->get()->getRow()->total_amount ?? 0;