app/Models/TransactionModel.php

    public function getMonthlyRevenu()
    {
        return $this->select("DATE_FORMAT(created_at,'%Y-%m') as month ,sum(total_amount) as total")
            ->groupBy("DATE_FORMAT(created_at,'%Y-%m')")
            ->orderBy("month", "ASC")
            ->findAll();
---
SELECT DATE_FORMAT(created_at, '%Y-%m') as month, sum(total_amount) as total
FROM `transactions`
GROUP BY DATE_FORMAT(created_at, '%Y-%m')
ORDER BY `month` ASC